from main.первичная_обработка import СырыеДанные
from main.считывание_узлов import Узлы
from main.подсчет_материалов import ПодсчетМатериалов
from main.формирование_таблиц import ФормированиеТаблицы
from main.загрузка_из_библиотек import Библиотека
from main.печать_в_файл import Печать


class Расчет:

    @staticmethod
    def _проверка_исходных_данных(словарь_исходных_данных):
        check = ["название_итогового_файла", "path_to_file",
                 "path_to_folder", "path_to_library", "main_library_sheet",
                 "local_library_sheet", "sheet_name", "метка_список",
                 "метка_узел", "метка_вложенный_узел", "шапка_таблицы",
                 "список_колонок_из_библиотеки",
                 "название_колонки_имен_библиотеки",
                 "номер_колонки_количества"]
        for glass in check:
            if glass not in словарь_исходных_данных.keys():
                raise ValueError("В словаре не хватает элемента"
                                 " - "+glass)

    def __init__(self, словарь_исходных_данных):
        self._проверка_исходных_данных(словарь_исходных_данных)
        self._название_итогового_файла = (
            словарь_исходных_данных["название_итогового_файла"]
        )
        self._path_to_file = (
            словарь_исходных_данных["path_to_file"]
        )
        self._path_to_folder = (
            словарь_исходных_данных["path_to_folder"]
        )
        self._path_to_library = (
            словарь_исходных_данных["path_to_library"]
        )
        self._main_library_sheet = (
            словарь_исходных_данных["main_library_sheet"]
        )
        self._local_library_sheet = (
            словарь_исходных_данных["local_library_sheet"]
        )
        self._sheet_name = (
            словарь_исходных_данных["sheet_name"]
        )
        self._метка_список = (
            словарь_исходных_данных["метка_список"]
        )
        self._метка_узел = (
            словарь_исходных_данных["метка_узел"]
        )
        self._метка_вложенный_узел = (
            словарь_исходных_данных["метка_вложенный_узел"]
        )
        self._шапка_таблицы = (
            словарь_исходных_данных["шапка_таблицы"]
        )
        self._список_колонок_из_библиотеки = (
            словарь_исходных_данных["список_колонок_из_библиотеки"]
        )
        self._название_колонки_имен_библ = (
            словарь_исходных_данных["название_колонки_имен_библиотеки"]
        )
        self._номер_колонки_количества = (
            словарь_исходных_данных["номер_колонки_количества"]
        )

    def __call__(self):
        data = СырыеДанные(self._path_to_file, self._sheet_name,
                           [self._метка_узел, self._метка_список,
                            self._метка_вложенный_узел])

        узлы = Узлы(self._метка_список, self._метка_узел,
                    self._метка_вложенный_узел)
        узлы(data)

        материалы = ПодсчетМатериалов(узлы.узлы, узлы.список_узлов)

        table = ФормированиеТаблицы(self._шапка_таблицы,
                                    [self._номер_колонки_количества])
        table(материалы.всё, материалы.части)

        из_глобальной_библ = Библиотека(self._шапка_таблицы,
                                        self._список_колонок_из_библиотеки,
                                        self._название_колонки_имен_библ)
        из_глобальной_библ(self._path_to_library,
                           self._main_library_sheet, data=table.one,
                           словарь_таблиц=table.multiple)

        итог = Библиотека(self._шапка_таблицы,
                          self._список_колонок_из_библиотеки,
                          self._название_колонки_имен_библ)
        итог(self._path_to_file, self._local_library_sheet,
             data=из_глобальной_библ.one,
             словарь_таблиц=из_глобальной_библ.multiple,
             нет_в_библ=из_глобальной_библ.not_in_lib)

        печать = Печать(self._path_to_folder,
                        self._название_итогового_файла,
                        self._шапка_таблицы, [0, 7])
        печать(table_to_xls=итог.one, dict_to_xls=итог.multiple)

        return итог.not_in_lib
